cf_billing/InformationRegisters/энргВзаиморасчетыПоследовательность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргВзаиморасчетыПоследовательность</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЭтоОплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кассир</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсточникПоступления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргИсточникиПоступления</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоКорректировкаОплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СостояниеПроведения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСостояниеДокументаВПоследовательности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаРегистратора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргБанкротство</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияРазовыхНачислений</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПлатежноеПоручениеВходящие</v8:Type>
						<v8:Type>cfg:DocumentRef.энргДополнительныеНачисления</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеМКД</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.энргАктБездоговорногоПотребления</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПоступлениеОплатыЧерезКонтроллера</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРучноеИзменениеПени</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачислениеПоРассрочке</v8:Type>
						<v8:Type>cfg:DocumentRef.энргНачисление</v8:Type>
						<v8:Type>cfg:DocumentRef.энргПерерасчет</v8:Type>
						<v8:Type>cfg:DocumentRef.энргРаспределениеМКД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргСобытия</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успех</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСпособСвязи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланируемаяДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>IDЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргЭтапыПретензионноИсковойДеятельностиЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЭтапыПретензионноИсковойДеятельностиЗадач</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОперацийПИД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСледЭтапа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрекращенаДеятельность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗадолженностиНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПериодЗадолженностиКонец</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СтартоваяЗадача</Name>
					<Type>
						<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаРрегистратор</Name>
					<Type>
						<v8:Type>cfg:TaskRef.энргЗадачаПИД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиНачисленияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиНачисленияПени</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГлубинаОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КрайнийСрокОплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяГлубинаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РассчитыватьНаТекущуюДату</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/AccumulationRegisters/энргВзаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>энргВзаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестНастройкаКритериевДляНачалаПИР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестНастройкаКритериевДляНачалаПИР</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СуммаЗадолженности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КоличествоНеоплаченныхПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Enums/энргСостояниеДокументаВПоследовательности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргСостояниеДокументаВПоследовательности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроведенВПоследовательности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведенСНарушениемПоследовательности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсключенИзПоследовательности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/энргРаботаСПоследовательностями/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область РегламетныеПроцедуры

// Регламентные процедуры Биллинга.
//
Процедура РегламетныеПроцедурыБиллинг() Экспорт 
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.энргРегламентныеПроцедуры);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.РегламетныеПроцедурыБиллинг();
	
КонецПроцедуры

// Восстанавливает последовательность взаиморасчетов.
//
Процедура ВосстановитьПоследовательностьВзаиморасчетов() Экспорт  
	
	Текст = 
	"ВЫБРАТЬ
	|	энргВзаиморасчетыПоследовательность.Организация КАК Организация,
	|	энргВзаиморасчетыПоследовательность.Район КАК Район,
	|	МИНИМУМ(энргВзаиморасчетыПоследовательность.ПериодНачисления) КАК ПериодНачисления
	|ИЗ
	|	РегистрСведений.энргВзаиморасчетыПоследовательность КАК энргВзаиморасчетыПоследовательность
	|ГДЕ
	|	НЕ энргВзаиморасчетыПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенВПоследовательности)
	|	И энргВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	энргВзаиморасчетыПоследовательность.Организация,
	|	энргВзаиморасчетыПоследовательность.Район";
	
	Запрос  						= Новый Запрос(Текст); 	
	Запрос.УстановитьПараметр("ПериодНачисления", НачалоМесяца(ТекущаяДатаСеанса()));
	Результат  						= Запрос.Выполнить();
	Выборка 						= Результат.Выбрать();
	
	ОписаниеПараметров = "Организация, ПериодНачисления, Район, МКД, Абонент, СписокМКД";
	Пока Выборка.Следующий() Цикл
		ПараметрыОперации = Новый Структура(ОписаниеПараметров);
		ПараметрыОперации.Организация = Выборка.Организация;
		ПараметрыОперации.ПериодНачисления = Выборка.ПериодНачисления;
		ПараметрыОперации.Район = Выборка.Район;
		ПараметрыОперации.СписокМКД = Неопределено;
				
		ПараметрыЗадания  			= Новый Массив;
		ПараметрыЗадания.Добавить(ПараметрыОперации);
		ФоновыеЗадания.Выполнить("энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты", ПараметрыЗадания);
	КонецЦикла;
		
КонецПроцедуры

// Процедура регламентного задания "Автоматическая рассылка уведомлений"
Процедура АвтоматическаяРассылкаУведомлений() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	энргСобытиеАбоненты.Ссылка КАК ДокСобытие,
		|	энргСобытияСрезПоследних.Абонент КАК Абонент,
		|	энргСобытиеАбоненты.НомерСтроки КАК НомерСтроки
		|ИЗ
		|	РегистрСведений.энргСобытия.СрезПоследних(
		|			,
		|			ПланируемаяДатаОтправки <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				И ПланируемаяДатаОтправки <= &ТекДата) КАК энргСобытияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргСобытие.Абоненты КАК энргСобытиеАбоненты
		|		ПО энргСобытияСрезПоследних.Регистратор = энргСобытиеАбоненты.Ссылка
		|			И энргСобытияСрезПоследних.ТипСобытия = энргСобытиеАбоненты.Ссылка.ТипСобытия
		|			И энргСобытияСрезПоследних.Абонент = энргСобытиеАбоненты.Абонент
		|			И энргСобытияСрезПоследних.Основание = энргСобытиеАбоненты.Основание
		|ИТОГИ ПО
		|	ДокСобытие";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокСобытие = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокСобытие.Следующий() Цикл
		ДокОъект = ВыборкаДокСобытие.ДокСобытие.ПолучитьОбъект();
		
		Если Ложь Тогда
			ДокОъект = Документы.энргСобытие.СоздатьДокумент();
		КонецЕсли;
		
		СписокНомеров = Новый Массив;
		Выборка = ВыборкаДокСобытие.Выбрать();
	
		Пока Выборка.Следующий() Цикл
			СписокНомеров.Добавить(Выборка.НомерСтроки);
		КонецЦикла;
		
		ДокОъект.ВыполнитьСобытия(СписокНомеров);
	КонецЦикла;
КонецПроцедуры

// Процедура регламентного задания "Закрытие задач ПИД по погашению задолженности"
Процедура ЗакрытиеЗадачПИД_ПоПогашениюЗадолженности() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргЭтапыПретензионноИсковойДеятельностиЗадачСрезПоследних.Абонент КАК Абонент,
		|	энргЭтапыПретензионноИсковойДеятельностиЗадачСрезПоследних.Этап КАК Этап,
		|	энргЭтапыПретензионноИсковойДеятельностиЗадачСрезПоследних.ДатаСледЭтапа КАК ДатаСледЭтапа,
		|	энргЭтапыПретензионноИсковойДеятельностиЗадачСрезПоследних.Организация КАК Организация,
		|	энргЭтапыПретензионноИсковойДеятельностиЗадачСрезПоследних.ПериодЗадолженностиНачало КАК НачалоПериода,
		|	энргЭтапыПретензионноИсковойДеятельностиЗадачСрезПоследних.Исполнитель КАК Ответственный,
		|	энргЗадачаПИД.Ссылка КАК Задача,
		|	энргЗадачаПИД.Район КАК Район
		|ПОМЕСТИТЬ ВТ_ЭтапыИОтветственные
		|ИЗ
		|	РегистрСведений.энргЭтапыПретензионноИсковойДеятельностиЗадач.СрезПоследних(&ТекДата, ) КАК энргЭтапыПретензионноИсковойДеятельностиЗадачСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.энргЗадачаПИД КАК энргЗадачаПИД
		|		ПО энргЭтапыПретензионноИсковойДеятельностиЗадачСрезПоследних.ЗадачаРрегистратор = энргЗадачаПИД.Ссылка
		|ГДЕ
		|	НЕ энргЗадачаПИД.ПометкаУдаления
		|	И НЕ энргЗадачаПИД.Выполнена
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргНастройкиНачисленияПениСрезПоследних.Организация КАК Организация,
		|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, -энргНастройкиНачисленияПениСрезПоследних.КрайнийСрокОплаты), МЕСЯЦ, -1), МЕСЯЦ) КАК ГраницаНачислений,
		|	энргНастройкиНачисленияПениСрезПоследних.КрайнийСрокОплаты КАК КрайнийСрокОплаты,
		|	энргНастройкиНачисленияПениСрезПоследних.Район КАК Район
		|ПОМЕСТИТЬ ВТ_КрайнийСрокОплаты
		|ИЗ
		|	РегистрСведений.энргНастройкиНачисленияПени.СрезПоследних(, ) КАК энргНастройкиНачисленияПениСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВзаиморасчеты.Организация КАК Организация,
		|	энргВзаиморасчеты.Район КАК Район,
		|	энргВзаиморасчеты.Абонент КАК Абонент,
		|	СУММА(ВЫБОР
		|			КОГДА энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|				ТОГДА энргВзаиморасчеты.Сумма
		|			КОГДА энргВзаиморасчеты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					И энргВзаиморасчеты.Сумма < 0
		|				ТОГДА -энргВзаиморасчеты.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК НеПросроченныеНачисления
		|ПОМЕСТИТЬ ВТ_НеПросроченныеНачисления
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты КАК энргВзаиморасчеты
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КрайнийСрокОплаты КАК ВТ_КрайнийСрокОплаты
		|		ПО энргВзаиморасчеты.Организация = ВТ_КрайнийСрокОплаты.Организация
		|			И энргВзаиморасчеты.Район = ВТ_КрайнийСрокОплаты.Район
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.энргАбоненты КАК энргАбоненты
		|		ПО энргВзаиморасчеты.Абонент = энргАбоненты.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЭтапыИОтветственные КАК ВТ_ЭтапыИОтветственные
		|		ПО энргВзаиморасчеты.Организация = ВТ_ЭтапыИОтветственные.Организация
		|			И энргВзаиморасчеты.Район = ВТ_ЭтапыИОтветственные.Район
		|			И энргВзаиморасчеты.Абонент = ВТ_ЭтапыИОтветственные.Абонент
		|ГДЕ
		|	ВЫБОР
		|			КОГДА энргАбоненты.КоличествоДнейОтсрочки > 0
		|				ТОГДА энргВзаиморасчеты.Период > КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&ТекДата, ДЕНЬ, -энргАбоненты.КоличествоДнейОтсрочки), МЕСЯЦ, -1), МЕСЯЦ)
		|			ИНАЧЕ ВТ_КрайнийСрокОплаты.ГраницаНачислений ЕСТЬ NULL
		|						И энргВзаиморасчеты.Период > КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекДата, МЕСЯЦ, -1), МЕСЯЦ)
		|					ИЛИ энргВзаиморасчеты.Период > ВТ_КрайнийСрокОплаты.ГраницаНачислений
		|		КОНЕЦ
		|	И энргВзаиморасчеты.Период <= &ТекДата
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчеты.Организация,
		|	энргВзаиморасчеты.Район,
		|	энргВзаиморасчеты.Абонент
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	энргВзаиморасчетыОстатки.Организация КАК Организация,
		|	энргВзаиморасчетыОстатки.Район КАК Район,
		|	энргВзаиморасчетыОстатки.Абонент КАК Абонент,
		|	энргВзаиморасчетыОстатки.СуммаОстаток - ЕСТЬNULL(ВТ_НеПросроченныеНачисления.НеПросроченныеНачисления, 0) КАК Задолженность,
		|	ВТ_ЭтапыИОтветственные.Этап КАК Этап,
		|	ВТ_ЭтапыИОтветственные.ДатаСледЭтапа КАК ДатаСледЭтапа,
		|	ВТ_ЭтапыИОтветственные.Ответственный КАК Ответственный,
		|	ВТ_ЭтапыИОтветственные.Задача КАК Задача
		|ИЗ
		|	РегистрНакопления.энргВзаиморасчеты.Остатки(
		|			&ТекДата,
		|			(Абонент, Организация, Район) В
		|				(ВЫБРАТЬ
		|					ВТ_ЭтапыИОтветственные.Абонент КАК Абонент,
		|					ВТ_ЭтапыИОтветственные.Организация КАК Организация,
		|					ВТ_ЭтапыИОтветственные.Район КАК Район
		|				ИЗ
		|					ВТ_ЭтапыИОтветственные КАК ВТ_ЭтапыИОтветственные)) КАК энргВзаиморасчетыОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_НеПросроченныеНачисления КАК ВТ_НеПросроченныеНачисления
		|		ПО энргВзаиморасчетыОстатки.Организация = ВТ_НеПросроченныеНачисления.Организация
		|			И энргВзаиморасчетыОстатки.Район = ВТ_НеПросроченныеНачисления.Район
		|			И энргВзаиморасчетыОстатки.Абонент = ВТ_НеПросроченныеНачисления.Абонент
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЭтапыИОтветственные КАК ВТ_ЭтапыИОтветственные
		|		ПО энргВзаиморасчетыОстатки.Организация = ВТ_ЭтапыИОтветственные.Организация
		|			И энргВзаиморасчетыОстатки.Абонент = ВТ_ЭтапыИОтветственные.Абонент
		|ГДЕ
		|	энргВзаиморасчетыОстатки.СуммаОстаток - ЕСТЬNULL(ВТ_НеПросроченныеНачисления.НеПросроченныеНачисления, 0) <= 0";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Попытка
			ТекстКомментария = "Деятельность прекращена регламентным заданием";
			
			ОбъектЗадача = Выборка.Задача.ПолучитьОбъект();
			
			ОбъектЗадача.ПрекращенаДеятельность = Истина;
			ОбъектЗадача.Комментарий			= ТекстКомментария;
			
			СтрокаТЧ = ОбъектЗадача.ИсторияПеренаправленийЗадачи.Добавить();
			СтрокаТЧ.ДатаПеренаправления = ТекущаяДатаСеанса();
			СтрокаТЧ.Комментарий		 = ТекстКомментария;
			СтрокаТЧ.Перенаправил		 = ПараметрыСеанса.ТекущийПользователь;
			
			ОбъектЗадача.ВыполнитьЗадачуИнтерактивно();
		Исключение
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

// Процедура регламентного задания "Открытие ПИР"
Процедура ОткрытиеПИР_ПоКритериям() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестНастройкаКритериевДляНачалаПИРСрезПоследних.Организация КАК Организация,
		|	бестНастройкаКритериевДляНачалаПИРСрезПоследних.Район КАК Район,
		|	бестНастройкаКритериевДляНачалаПИРСрезПоследних.СуммаЗадолженности КАК СуммаЗадолженности,
		|	бестНастройкаКритериевДляНачалаПИРСрезПоследних.КоличествоНеоплаченныхПериодов КАК КоличествоНеоплаченныхПериодов
		|ИЗ
		|	РегистрСведений.бестНастройкаКритериевДляНачалаПИР.СрезПоследних(&ТекущаяДата, ) КАК бестНастройкаКритериевДляНачалаПИРСрезПоследних";
	
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПрименитьКритерий(Выборка.Организация, Выборка.Район, Выборка.СуммаЗадолженности, Выборка.КоличествоНеоплаченныхПериодов);
	КонецЦикла;
КонецПроцедуры

Процедура ПрименитьКритерий(Организация, Район, СуммаЗадолженности, КоличествоНеоплаченныхПериодов)

	Отборы = Новый Структура("Организация, Район, Задолженность, КоличествоНеоплаченныхПериодов, ТекДата",
								Организация, Район, СуммаЗадолженности, КоличествоНеоплаченныхПериодов, ТекущаяДата());

	Запрос = Обработки.энргРаботаСДолжниками.ПолучитьЗапрос(Отборы, Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаАбонент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаАбонент.Следующий() Цикл
		ПарамЗадачи = Новый Структура("Абонент, Организация, Район, СуммаЗадолженности,ЛицевойСчет, АдресОбъекта,ПериодНачисления");
		ПарамЗадачи.Вставить("МКД", ВыборкаАбонент.Дом);
		
		энргПользовательскийВводСервер.УстановитьЗависимыеРеквизитыАбонента(ВыборкаАбонент.Абонент, ПарамЗадачи);
		ЗаполнитьЗначенияСвойств(ПарамЗадачи, ВыборкаАбонент);
		
		Задолженность = Новый ТаблицаЗначений;
		Задолженность.Колонки.Добавить("Услуга", 			Новый ОписаниеТипов("СправочникСсылка.энргВидыУслуг"));
		Задолженность.Колонки.Добавить("ПериодНачисления", 	Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
		Задолженность.Колонки.Добавить("Задолженность",		Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2)));
		
		ВыборкаПериодНачисления = ВыборкаАбонент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПериодНачисления.Следующий() Цикл
			
			Выборка = ВыборкаПериодНачисления.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока Выборка.Следующий() Цикл
				СтрокаТЗ = Задолженность.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТЗ, Выборка);
			КонецЦикла;
		КонецЦикла;
		
		Попытка
			НачатьТранзакцию();
			
			НовЗадача = Задачи.энргЗадачаПИД.СоздатьЗадачу();
			НовЗадача.Дата = ТекущаяДата();
			ЗаполнитьЗначенияСвойств(НовЗадача, ПарамЗадачи); 
			СуммаДолга = 0;
			Для каждого СтрокаЗадол Из Задолженность Цикл
				СтрокаТЧ = НовЗадача.Задолженность.Добавить();
				
				ЗаполнитьЗначенияСвойств(СтрокаТЧ, СтрокаЗадол);
				СуммаДолга = СуммаДолга + СтрокаЗадол.Задолженность;
			КонецЦикла;
			
			НовЗадача.СуммаЗадолженности = СуммаДолга;
			
			Задачи.энргЗадачаПИД.ЗаполнитьНаименованиеИЭтап(НовЗадача);
			НовЗадача.Записать();
			
			Если Не ЗначениеЗаполнено(НовЗадача.Схема) Или Не ЗначениеЗаполнено(НовЗадача.Исполнитель) Тогда
				
				ОтменитьТранзакцию();
			Иначе 
				ЗафиксироватьТранзакцию();
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось создать задачу для абонента " + ВыборкаАбонент.Абонент + " по причине: " + ОписаниеОшибки());
			ОтменитьТранзакцию();
		КонецПопытки;

	КонецЦикла;
КонецПроцедуры

// Отложенные движения документов начисления.
//
// Параметры:
//  Параметры	-	Структура	- см. энргВыолнениеНачислений.ПараметрыОперацииПоЗаданию.
//
Процедура ОтложенныеДвиженияДокументовНачисления(Параметры) Экспорт
	
	Инструмент = энргФабрикаИнструментовНачисления.СервисВыполненияОтложенныхДвижений();
	Если Инструмент = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли;
	
	ОсновныеПараметры = Инструмент.НовыеОсновныеПараметры();
	ЗаполнитьЗначенияСвойств(ОсновныеПараметры, Параметры);
	ОсновныеПараметры.Строение = Параметры.МКД;
	
	Инструмент.ВыполнитьОтложенныеДвиженияДокументов(ОсновныеПараметры);
	
КонецПроцедуры

// Отложенные Движения Документов Начисления МКД.
//
// Параметры:
//  Параметры	-	Структура	- см. энргВыолнениеНачислений.ПараметрыОперацииПоЗаданию.
//
Процедура ОтложенныеДвиженияДокументовНачисленияМКД(Параметры) Экспорт 
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 	
	Инструменты.ОтложенныеДвиженияДокументовНачисленияМКД(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район, Параметры.МКД);
	
КонецПроцедуры

// Пересчитывает средний объем потребления МКД.
//
// Параметры:
//  Организация			-	СправочникСсылка.Организации.
//  ПериодНачисления	-	Дата.
//  Район				-	СправочникСсылка.энргЗоныОтвественности.
//  Дом					-	Строка.
//
Процедура ПересчитатьСреднийОбъемПотребленияМКД(Организация, ПериодНачисления,Район,Дом=Неопределено) Экспорт 
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ПересчитатьСреднийОбъемПотребленияМКД(Организация, ПериодНачисления,Район,Дом);
	
КонецПроцедуры

// Пересчитывает средний объем потребления абонентов.
// 
// Параметры: 
//   Организация		-	СправочникСсылка.Организации.
//   ПериодНачисления	-	Дата.
//   Район				-	СправочникСсылка.энргЗоныОтвественности.
//   ОтборПоДому		-	Булево.
//   МКД				-	СправочникСсылка.энргСтроения.
//   Абонент			-	СправочникСсылка.энргАбоненты.
//
Процедура ПересчитатьСреднийОбъемПотребленияАбонентов(Организация, ПериодНачисления,Район,ОтборПоДому=ложь,МКД = Неопределено,Абонент = Неопределено) Экспорт 
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ПересчитатьСреднийОбъемПотребленияАбонентов(Организация, ПериодНачисления,Район,ОтборПоДому,МКД,Абонент);
	
КонецПроцедуры

#КонецОбласти

// Восстанавливает последовательность по абоненту.
// 
// Параметры:
//	 Организация		- Организация.
//   ПериодНачисления 	- Период Начисления.
//   Район				- Район.
//	 ЧастныйСектор 		- Частный Сектор.
//	 Строение			- Строение.
//	 Помещение			- Помещение.
//	 ТолькоПоказания	- Только Показания.
//   Абонент			- Абонент.
//
Процедура ВосстановитьПоследовательностьПоАбоненту(Организация, ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,Абонент = Неопределено,ТолькоПоказания = Истина) Экспорт  
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВосстановитьПоследовательностьПоАбоненту(Организация, ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение,Абонент,ТолькоПоказания);

КонецПроцедуры

// Восстанавливает последовательность по абоненту.
// 
// Параметры:
//	 Организация 		- Организация.
//   ПериодНачисления 	- Период Начисления.
//   Район				- Район.
//   МКД				- МКД.
//
Процедура ВосстановитьПоследовательностьПоМКД(Организация, ПериодНачисления,Район,МКД) Экспорт  
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВосстановитьПоследовательностьПоМКД(Организация, ПериодНачисления,Район,МКД);

КонецПроцедуры

// Выполняет регламетные операции ОДН.
// 
// Параметры:
//	 Организация 		- Организация.
//   ПериодНачисления 	- Период Начисления.
//   Район				- Район.
//
Процедура ВыполнитьРегламетныеОперацииОДН(Организация, ПериодНачисления,Район) Экспорт 	
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВыполнитьРегламетныеОперацииОДН(Организация, ПериодНачисления,Район);

КонецПроцедуры

// Выполняет регламетные операции индивидуальные.
// 
// Параметры:
//	 Организация 		- Организация.
//   ПериодНачисления 	- Период Начисления.
//   Район				- Район.
//
Процедура ВыполнитьРегламетныеОперацииИндивидуальные(Организация, ПериодНачисления,Район) Экспорт  	
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВыполнитьРегламетныеОперацииИндивидуальные(Организация, ПериодНачисления,Район);
	
КонецПроцедуры

// Восстанавливает последовательность стабильные периоды.
// 
// Параметры:
//	 Параметры 			- Параметры.
//
Процедура ВосстановитьПоследовательностьСтабильныеПериоды(Параметры) Экспорт 

	СервисВзаимодействияСБД 					= энргФабрикаИнструментовНачисления.СервисПроведенияПоСтабильнымПериодам();
	Если СервисВзаимодействияСБД = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли;
	
	СервисВзаимодействияСБД.Организация  					= Параметры.Организация;
	СервисВзаимодействияСБД.ПериодНачисления				= Параметры.ПериодНачисления;
	СервисВзаимодействияСБД.Район							= Параметры.Район;
	СервисВзаимодействияСБД.ЧастныйСектор 					= Параметры.ЧастныйСектор;
	СервисВзаимодействияСБД.Строение						= Параметры.Строение;
	СервисВзаимодействияСБД.Помещение						= Параметры.Помещение;
	СервисВзаимодействияСБД.ПроверятьДатуЗапретаИзменения	= Истина;
	
	Ошибки 													= ""; 	
		
	ОбъектПроведениеПоСтабильнымПериодам		= энргФабрикаИнструментовНачисления.ПроведениеПоСтабильнымПериодам();
	Если ОбъектПроведениеПоСтабильнымПериодам = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли;
	
	ОбъектПроведениеПоСтабильнымПериодам.ВосстановитьПоследовательность(СервисВзаимодействияСБД, Ошибки);	
	
	Если Не ПустаяСтрока(Ошибки) Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;	
			
КонецПроцедуры

// Восстанавливает последовательность стабильные периоды перерасчет.
//
// Параметры:
//	 Организация                - Организация.
//	 Район                      - Район.
//	 ЧастныйСектор              - Частный Сектор.
//	 Строение                   - Строение.
//	 Помещения                  - Помещение.
//	 ПериодНачисленияНачало     - Период Начисления Начало.
//	 ПериодНачисленияЗавершение - Период Начисления Завершение.
//	 ИсточникиДанных            - Источники Данных.
//	 ДополнительныеРеквизиты    - Дополнительные Реквизиты.
//
Процедура ВосстановитьПоследовательностьСтабильныеПериодыПерерасчет(Организация, Район,ЧастныйСектор,Строение,Помещения,ПериодНачисленияНачало,ПериодНачисленияЗавершение,ИсточникиДанных,ДополнительныеРеквизиты) Экспорт 

	СервисВзаимодействияСБД 					= энргФабрикаИнструментовНачисления.СервисПроведенияПоСтабильнымПериодамПерерасчет();
	Если СервисВзаимодействияСБД = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли;
	
	СервисВзаимодействияСБД.Организация  					= Организация;
	СервисВзаимодействияСБД.Район							= Район;
	СервисВзаимодействияСБД.ЧастныйСектор 					= ЧастныйСектор;
	СервисВзаимодействияСБД.Строение						= Строение;
	СервисВзаимодействияСБД.мПомещения						= Помещения;
	СервисВзаимодействияСБД.ПериодНачисленияНачало			= ПериодНачисленияНачало;
	СервисВзаимодействияСБД.ПериодНачисленияЗавершение		= ПериодНачисленияЗавершение;
	СервисВзаимодействияСБД.ПроверятьДатуЗапретаИзменения	= Ложь;
	СервисВзаимодействияСБД.ПодключениеУслугиПервыйДокумент	= ДополнительныеРеквизиты.ПодключениеУслугиПервыйДокумент;

	Ошибки 												= Новый Массив; 	
		
	ОбъектПроведениеПоСтабильнымПериодам				= энргФабрикаИнструментовНачисления.ПроведениеПоСтабильнымПериодам();
	Если ОбъектПроведениеПоСтабильнымПериодам = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли;
	
	ОбъектПроведениеПоСтабильнымПериодам.ВосстановитьПоследовательность(СервисВзаимодействияСБД, Ошибки, Истина, Истина);	
	
	Если Ошибки.Количество() > 0 Тогда
		ВызватьИсключение Ошибки;
	КонецЕсли;	
	
	ИсточникиДанных.НаборСтабильныеПериоды 				= СервисВзаимодействияСБД.НаборПериоды;
	ИсточникиДанных.НаборСтабильныеПериодыШкалы 		= СервисВзаимодействияСБД.НаборШкалы;
	ИсточникиДанных.НаборСтабильныеПериодыИзмерители 	= СервисВзаимодействияСБД.НаборИзмерители;
	
КонецПроцедуры

// Восстанавливает последовательность стабильные периоды МКД.
// 
// Параметры:
//	 Параметры			- Параметры.
//
Процедура ВосстановитьПоследовательностьСтабильныеПериодыМКД(Параметры) Экспорт 
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВосстановитьПоследовательностьСтабильныеПериодыМКД(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район, Параметры.МКД);
			
КонецПроцедуры

// Восстанавливает последовательность показания ПУ.
// 
// Параметры:
//	 Параметры 			- Параметры.
//
Процедура ВосстановитьПоследовательностьПоказанияПУ(Параметры) Экспорт 
	
	//Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	//Если Инструменты = Неопределено тогда
	//	ВызватьИсключение "Не удалось создать защищенный объект";
	//	Возврат;
	//КонецЕсли; 
	//Инструменты.ВосстановитьПоследовательностьПоказанияПУ(Организация, ПериодНачисления,Район,ЧастныйСектор,Строение,Помещение);
	
	Инструмент = энргФабрикаИнструментовНачисления.СервисВосстановленияПоследовательностиПоказанийПУ(); 
	Если Инструмент = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли;
	
	Инструмент.Организация  	= Параметры.Организация;
	Инструмент.ПериодНачисления	= Параметры.ПериодНачисления;
	Инструмент.Район			= Параметры.Район;
	Инструмент.ЧастныйСектор 	= Параметры.ЧастныйСектор;
	Инструмент.Строение			= Параметры.Строение;
	Инструмент.Помещение		= Параметры.Помещение;
	
	Инструмент.ВосстановитьПоследовательность();
	
КонецПроцедуры

// Восстанавливает последовательность показания ПУ МКД.
// 
// Параметры:
//	 Параметры			- Параметры.
//
Процедура ВосстановитьПоследовательностьПоказанияПУМКД(Параметры) Экспорт 
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.ВосстановитьПоследовательностьПоказанияПУМКД(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район, Параметры.МКД);
	
КонецПроцедуры

// Восстанавливает последовательность взаиморасчетов.
// 
// Параметры:
//	 Параметры 			- Параметры.
//	 Многопоточность	- Многопоточность.
//
Процедура ВосстановитьПоследовательностьВзаиморасчеты(Параметры, Многопоточность = Ложь) Экспорт 
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли;
	
	Если Многопоточность И Параметры.МКД = Неопределено И Не ЗначениеЗаполнено(Параметры.Абонент) И Не ЗначениеЗаполнено(Параметры.СписокМКД) Тогда
		// многопоточно
		ДлительныеОперацииСписок = Новый Массив;
		// ЧС
		ПараметрыОтбора = НовыеПараметрыОтборов();  
		ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Параметры);
		ПараметрыОтбора.МКД	= Справочники.энргСтроения.ПустаяСсылка();
		
		ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(Неопределено, ПараметрыОтбора);
		ДлительныеОперацииСписок.Добавить(ДлительнаяОперация);
		
		// МКД
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	энргВзаиморасчетыПоследовательность.МКД КАК МКД,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ энргВзаиморасчетыПоследовательность.Абонент) КАК Абонент
		|ПОМЕСТИТЬ ВТ
		|ИЗ
		|	РегистрСведений.энргВзаиморасчетыПоследовательность КАК энргВзаиморасчетыПоследовательность
		|ГДЕ
		|	энргВзаиморасчетыПоследовательность.Организация = &Организация
		|	И энргВзаиморасчетыПоследовательность.Район = &Район
		|	И энргВзаиморасчетыПоследовательность.ПериодНачисления = &ПериодНачисления
		|	И энргВзаиморасчетыПоследовательность.МКД <> ЗНАЧЕНИЕ(Справочник.энргСтроения.ПустаяСсылка)
		|	И энргВзаиморасчетыПоследовательность.СостояниеПроведения = ЗНАЧЕНИЕ(Перечисление.энргСостояниеДокументаВПоследовательности.ПроведенСНарушениемПоследовательности)
		|
		|СГРУППИРОВАТЬ ПО
		|	энргВзаиморасчетыПоследовательность.МКД
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ.МКД КАК МКД
		|ИЗ
		|	ВТ КАК ВТ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ВТ.Абонент УБЫВ";
		
		Запрос.УстановитьПараметр("ПериодНачисления", Параметры.ПериодНачисления);
		Запрос.УстановитьПараметр("Организация", Параметры.Организация);
		Запрос.УстановитьПараметр("Район", Параметры.Район);
		РезультатЗапроса = Запрос.Выполнить(); 	
		Выборка = РезультатЗапроса.Выбрать();
		МаксимальноеКолиествоПотоков = 10;
		ОбщееКоличество = Выборка.Количество();		
		Если ОбщееКоличество <= МаксимальноеКолиествоПотоков Тогда 
			Порция = ОбщееКоличество;
		Иначе 
			Порция = Цел(ОбщееКоличество / МаксимальноеКолиествоПотоков);
			Если (ОбщееКоличество % МаксимальноеКолиествоПотоков) > 0 Тогда			
				Порция = Порция + 1;
			КонецЕсли;
		КонецЕсли;	
		
		Итерация = 0; 
		ПодготовленныеПотоки = Новый Массив;
		Для Сч = 1 По МаксимальноеКолиествоПотоков Цикл
			ПодготовленныеПотоки.Добавить(Новый Массив);		
		КонецЦикла;
		
		Пока Выборка.Следующий() Цикл
			Если Итерация >  МаксимальноеКолиествоПотоков - 1 Тогда
				Итерация = 0;
			КонецЕсли;
			ПодготовленныеПотоки[Итерация].Добавить(Выборка.МКД);
			Итерация = Итерация + 1;
		КонецЦикла;
		
		Для Каждого Поток из ПодготовленныеПотоки Цикл 
			ПараметрыОтбора = НовыеПараметрыОтборов();
			ЗаполнитьЗначенияСвойств(ПараметрыОтбора, Параметры);
			ПараметрыОтбора.СписокМКД		= Поток;
			ДлительнаяОперация = ЗапуститьФоновоеЗаданиеСервер(Неопределено, ПараметрыОтбора);
			ДлительныеОперацииСписок.Добавить(ДлительнаяОперация);
		КонецЦикла;   
		
		ОжидатьЗавершениеВсехПотоков(ДлительныеОперацииСписок);
		
	КонецЕсли;
	
	Инструменты.ВосстановитьПоследовательностьВзаиморасчеты(Параметры.Организация, Параметры.ПериодНачисления, Параметры.Район, Параметры.МКД, Параметры.Абонент, Параметры.СписокМКД);
	
КонецПроцедуры

// Сбрасывает состояние последовательности.
// 
// Параметры:
//	 ИмяПоследовательности - Имя Последовательности.
//	 Организация		   - Организация.
//   ПериодНачисления 	   - Период Начисления.
//   Район				   - Район.
//   МКД				   - МКД.
//   Абонент			   - Абонент.
//
Процедура СброситьСостояниеПоследовательности(ИмяПоследовательности,Организация, ПериодНачисления,Район,МКД,Абонент = Неопределено) Экспорт 
	
	Инструменты  		= энргФабрикаИнструментовНачисления.РаботаСПоследовательностями();
	Если Инструменты = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли; 
	Инструменты.СброситьСостояниеПоследовательности(ИмяПоследовательности,Организация,ПериодНачисления,Район,МКД,Абонент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Многопоточность

// Восстанавливает последовательность показания ПУ.
// 
// Параметры:
//   ПериодНачисления 	- Период Начисления.
//   Район				- Район.
//   МКД				- МКД.
//   Абонент			- Абонент.
//
Процедура ВосстановитьПоследовательностьПоказанияПУМногопоточно(Параметры) Экспорт 
	
	Инструмент = энргФабрикаИнструментовНачисления.СервисВосстановленияПоследовательностиПоказанийПУ(); 
	Если Инструмент = Неопределено тогда
		ВызватьИсключение "Не удалось создать защищенный объект";
		Возврат;
	КонецЕсли;
	
	Инструмент.Организация  	= Параметры.Организация;
	Инструмент.ПериодНачисления	= Параметры.ПериодНачисления;
	Инструмент.Район			= Параметры.Район;
	Инструмент.ЧастныйСектор 	= Параметры.ЧастныйСектор;
	Инструмент.Строение			= Параметры.Строение;
	Инструмент.Помещение		= Параметры.Помещение;
	Инструмент.Строения			= Параметры.Строения;
	
	Инструмент.ВосстановитьПоследовательность();
	
КонецПроцедуры
	
#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОжидатьЗавершениеВсехПотоков(ДлительныеОперацииСписок)
	
	ЗавершенныеЗадания = Новый Массив;
	Пока Истина Цикл
		
		Если ЗавершенныеЗадания.Количество() = ДлительныеОперацииСписок.Количество() Тогда 
			Прервать;
		КонецЕсли;
		
		
		Для Каждого ДлительнаяОперация из ДлительныеОперацииСписок Цикл 
			
			Если НЕ ЗавершенныеЗадания.Найти(ДлительнаяОперация) = Неопределено Тогда 
				Продолжить;
			КонецЕсли;
			
			
			Выполнено = Ложь;
			Попытка
				
				Выполнено = ДлительныеОперации.ЗаданиеВыполнено(ДлительнаяОперация.ИдентификаторЗадания);	
				
			Исключение
				// Завершенные аварийно задания помещаем как выполненные
				Выполнено = Истина;
			КонецПопытки;
			
			Если Выполнено Тогда 
				ЗавершенныеЗадания.Добавить(ДлительнаяОперация);
			КонецЕсли; 			
			
		КонецЦикла;
		
		ОбменДаннымиСервер.Пауза(5);
		
	КонецЦикла; 	
	
КонецПроцедуры

Функция НовыеПараметрыОтборов()
	
	Результат = Новый Структура;
	Результат.Вставить("ПериодНачисления"		, Дата(1,1,1));
	Результат.Вставить("Организация"			, Справочники.Организации.НашаОрганизация);
	Результат.Вставить("Район"					, Справочники.энргЗоныОтвественности.ПустаяСсылка());
	Результат.Вставить("МКД"					, Неопределено);
	Результат.Вставить("Абонент"				, Неопределено);
	Результат.Вставить("СписокМКД"				, Неопределено);
	
	Возврат Результат;	
	
КонецФункции

Функция ЗапуститьФоновоеЗаданиеСервер(ИдентификаторФормы, ПараметрыОтбора)
	
	НаименованиеФоновогоЗадания = НСтр(
		СтрШаблон(
			"ru = 'Восстановление взаиморасчетов %1 за %2'", 
			ПараметрыОтбора.Район,
			Формат(ПараметрыОтбора.ПериодНачисления, "ДФ='ММММ гггг'")));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.ЗапуститьНеВФоне = Ложь;
	ПараметрыВыполнения.ОжидатьЗавершение = 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеФоновогоЗадания;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", ИдентификаторФормы);
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
		ПараметрыВыполнения, 
		"энргРаботаСПоследовательностями.ВосстановитьПоследовательностьВзаиморасчеты",
		
		ПараметрыОтбора);
	
	Возврат ДлительнаяОперация;
	
КонецФункции

#КонецОбласти
